S17-x2-SuperBee-rhoEnergyFoam-maxCo0.5-chamfer-Euler/system/FOIDDES
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

DESField
{
    // Mandatory entries
    type            DESModelRegions;
    libs            (fieldFunctionObjects);
    // Optional entries
    result          DESField;
    // Optional (inherited) entries
    writePrecision   6;
    writeToFile      true;
    useUserTime      false;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 10;
    writeControl    writeTime;
    writeInterval   10;
}

// ************************************************************************* //