S17-x2-SuperBee-rhoEnergyFoam-maxCo0.5-chamfer-Euler/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
   "libcompressibleTurbulenceModels.so"
   "libfindroot.so"
   "libhisaFiniteVolume.so"
   "libvelocityOutletNSCBCx.so" 
   "libpressureOutletNSCBC.so"
   "libtemperatureOutletNSCBC.so"
);
application     hisa;

startFrom    latestTime;

startTime    0;

stopAt    endTime;

endTime    0.1;

deltaT    1.0e-8;

writeControl    adjustableRunTime;

writeInterval    0.5e-4;

purgeWrite    0;

writeFormat    binary;

writePrecision   6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable    true;

adjustTimeStep  yes;

maxCo    0.5;

maxDeltaT       1e-5;


pressArtDiff    true; //activate artificial diffusion on pressure
convArtDiff     true; //activate artificial diffusion on pressure

ku        0.25;
kp        0.25;
ducLevelPress       0.00; // pressure diffusion threshold
ducLevelConv        0.05; // convective diffusion threshold
epsilon             117649; // u_infty^2
minfty              1; // Reference Mach^2 number needed by AUSM flux (free stream Mach number)



functions
{
//    #includeFunc MachNo
//    #includeFunc yPlus
//    #includeFunc writeCellCentres
//    #includeFunc vorticity
//    #includeFunc grad(p)
//    #includeFunc fieldAverage(U, p, prime2Mean = yes)
}


// ************************************************************************* //
